<template>
  <div class="reasonWrapper">
    <h2 class="reasonTitle">Почему КХ"Тен"?</h2>
    <div class="reasonInfoWrapper">
      <div class="reasonInfo">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M24.5986 13.4C26.9683 13.4 28.8893 11.5494 28.8893 9.26663C28.8893 6.98386 26.9683 5.1333 24.5986 5.1333C22.2289 5.1333 20.308 6.98386 20.308 9.26663C20.308 11.5494 22.2289 13.4 24.5986 13.4Z" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M24.5986 1V2.03333" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M24.5986 16.5V17.5333" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M17.1972 5.1333L18.0554 5.64997" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M32 13.4L31.1419 12.8833" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M32 5.1333L31.1419 5.64997" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M27.8166 32C24.7059 28.28 19.8789 25.8 14.4083 25.8C8.93771 25.8 4.11073 28.28 1 32H27.8166Z" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M10.654 11.3334C5.71971 11.3334 1.64359 14.8467 1.10726 19.4967C0.999991 20.1167 1.53632 20.6334 2.17992 20.6334H19.2353C19.8789 20.6334 20.4152 20.1167 20.3079 19.4967C19.6643 14.8467 15.5882 11.3334 10.654 11.3334Z" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14.9446 20.6334C14.7301 15.3634 12.9066 11.3334 10.654 11.3334C8.40139 11.3334 6.68513 15.3634 6.36333 20.6334" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M10.654 20.6333V25.8" stroke="black" stroke-width="2" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
        Овощи выращиваются только в свои оптимальные периоды, а именно в период весна-лето.
        Благодаря этому наша продукция обладает особенным вкусом, сезонной свежестью и высоким качеством
      </div>
      <div class="reasonInfo">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M6.28884 19.1478C6.2184 20.6459 7.31025 22.4062 7.31025 22.4062V25.702C6.39451 26.7881 5.54921 25.702 5.54921 25.702V21.4698C5.54921 21.4698 2.73155 20.3837 1.53404 16.7883C1.53404 16.7883 0.759185 15.1029 1.07617 10.9457C1.07617 10.9457 1.39316 4.76605 6.32407 1.13316C6.32407 1.13316 6.64105 0.833545 7.02848 1.13316C7.02848 1.13316 10.2336 3.82974 10.9732 7.57499C10.9732 7.57499 11.4311 8.36149 11.5015 12.294C11.5015 12.294 11.1493 16.6759 8.0851 18.6235C8.0851 18.6235 7.80334 18.8482 7.38069 18.6609C7.38069 18.6609 7.02848 18.4362 7.2398 17.762C7.2398 17.762 8.43731 16.3014 9.03606 15.2902C9.03606 15.2902 10.0575 13.6048 10.1279 11.1704C10.1279 11.1704 10.2336 8.17422 8.9304 6.52631L7.59201 4.39153C7.59201 4.39153 6.92282 3.79229 6.71149 3.38031C6.71149 3.38031 5.93664 3.49267 4.52781 6.26415C4.52781 6.26415 3.11898 7.8746 2.55544 10.9832C2.55544 10.9832 2.34412 16.8257 4.38692 18.3613C4.38692 18.3613 4.1756 12.5936 4.49259 11.9569C4.49259 11.9569 4.77435 8.73601 6.14796 7.7997C6.14796 7.7997 7.13414 7.31282 6.74671 8.92327C6.74671 8.92327 5.97186 11.0955 5.8662 13.7921C5.8662 13.7921 5.90142 15.9643 5.93664 16.7883L6.28884 19.1478Z" fill="black" stroke="black" stroke-width="0.25" stroke-miterlimit="10"/>
          <path d="M8.33164 26.5259C8.33164 26.5259 6.14795 28.6606 5.30266 30.7954C5.30266 30.7954 5.09133 31.6568 5.5492 31.9565C5.5492 31.9565 6.25362 32.2561 6.78193 31.2823C6.78193 31.2823 8.12032 28.3236 10.4449 26.5259C10.4449 26.5259 14.3192 20.8705 25.2728 21.5447C25.2728 21.5447 26.0477 21.0578 25.2728 20.3088C25.2728 20.3088 21.8564 19.7844 19.4966 20.3088C19.4966 20.3088 13.4739 20.8331 9.9518 24.803C9.9518 24.803 9.70525 20.1589 11.9242 18.4361C11.9242 18.4361 14.5657 15.0654 19.8841 15.5523C19.8841 15.5523 25.7659 15.7021 30.1685 20.6458C30.1685 20.6458 26.9986 27.0127 20.518 29.0352C20.518 29.0352 14.7418 29.8966 10.8675 28.0614C10.8675 28.0614 9.59959 28.024 10.5153 29.1475C10.5153 29.1475 12.5934 31.3198 19.9193 30.8703C19.9193 30.8703 28.7949 28.6606 32 20.5709C32 20.5709 28.7597 14.8781 22.0677 14.0542C22.0677 14.0542 16.5029 13.043 13.5443 15.0654C13.5443 15.0654 9.91658 16.4137 9.17694 20.1215C9.14172 20.1215 8.68385 20.8331 8.33164 26.5259Z" fill="black" stroke="black" stroke-width="0.25" stroke-miterlimit="10"/>
        </svg>
        Мы придерживаемся устойчивого сельского хозяйства, используя органические методы и минимизируя химию.
        Наши овощи безопасны для вашего здоровья и произведены с уважением к природе.
      </div>
      <div class="reasonInfo">
        <svg width="31" height="32" viewBox="0 0 31 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M15 11.3333C17.7614 11.3333 20 9.02014 20 6.16667C20 3.3132 17.7614 1 15 1C12.2386 1 10 3.3132 10 6.16667C10 9.02014 12.2386 11.3333 15 11.3333Z" fill="black" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M15 10.3C17.2091 10.3 19 8.44944 19 6.16666C19 3.88388 17.2091 2.03333 15 2.03333C12.7909 2.03333 11 3.88388 11 6.16666C11 8.44944 12.7909 10.3 15 10.3Z" fill="white" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M3 9.26672L0 14.9501H6L3 9.26672Z" fill="black"/>
          <path d="M3 10.3L1 14.4334H5L3 10.3Z" fill="white" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M31 9.5H25V15.5H31V9.5Z" fill="black"/>
          <path d="M30.5 10H25.5V15H30.5V10Z" fill="white" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M0 15.8079H6.231V16.3314L6.975 17.8668L11.284 13.4H19.747L23.467 17.8668L25.172 15.9824H31V16.7152C31 16.7152 30.535 18.5648 29.419 18.9137C29.419 18.9137 28.396 18.8439 27.683 19.7163L25.048 23.8691C25.048 23.8691 23.963 25.3696 22.413 23.8691L20.615 22.0893V31.4417C20.615 31.4417 20.088 32.698 19.22 31.4417V19.8559C19.22 19.8559 19.747 19.1929 20.46 19.8559L23.467 22.8222C23.467 22.8222 24.149 22.9269 24.459 22.0195C24.459 22.0195 25.916 19.1929 26.567 18.7392C26.567 18.7392 27.466 17.6225 28.83 17.6574C28.83 17.6574 29.388 17.4481 29.45 16.7152H26.443L23.994 19.9955C23.994 19.9955 23.529 20.2398 23.157 19.9955L19.096 14.8657H12.028L7.347 20.0304C7.347 20.0304 6.634 20.5539 6.169 19.7512C6.169 19.7512 5.022 17.3783 4.402 16.7152H1.581C1.581 16.7152 1.674 17.5527 2.232 17.7621C2.232 17.7621 3.906 17.8668 4.526 19.0882L6.448 22.6477C6.448 22.6477 7.254 23.3456 7.967 22.2638L10.695 19.4721C10.695 19.4721 11.501 19.1231 11.749 19.8559V31.5115C11.749 31.5115 11.315 32.5584 10.602 31.5115V21.7753L8.308 23.9389C8.308 23.9389 7.719 24.5321 6.944 24.6368C6.944 24.6368 5.797 24.6019 5.301 23.6248C5.301 23.6248 3.968 20.4492 3.72 20.3445C3.72 20.3445 3.224 19.4023 1.984 19.2627C1.984 19.2627 0.403 18.8439 0.217 17.5527L0 15.8079Z" fill="black"/>
        </svg>
        Мы предлагаем широкий ассортимент овощей, чтобы удовлетворить все ваши потребности
      </div>
      <div class="reasonInfo">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M16.2829 19.3144C21.5103 19.3144 25.7479 15.2146 25.7479 10.1572C25.7479 5.09982 21.5103 1 16.2829 1C11.0555 1 6.81793 5.09982 6.81793 10.1572C6.81793 15.2146 11.0555 19.3144 16.2829 19.3144Z" fill="black" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M16.2829 17.8861C20.695 17.8861 24.2717 14.4257 24.2717 10.1571C24.2717 5.8885 20.695 2.4281 16.2829 2.4281C11.8708 2.4281 8.29413 5.8885 8.29413 10.1571C8.29413 14.4257 11.8708 17.8861 16.2829 17.8861Z" fill="white" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
          <path d="M2.21569 25.6992L10.5518 21.6667C11.4202 21.2466 12.3754 21.4147 13.07 21.9187L14.7199 23.1789C15.5882 23.851 16.8039 23.851 17.6723 23.1789L19.409 21.8347C20.1036 21.3306 21.0588 21.1626 21.8403 21.5827L30.6975 25.6992C31.479 26.0353 32 26.8754 32 27.7155V29.7317C32 30.9919 30.958 32 29.6555 32H3.34454C2.04202 32 1 30.9919 1 29.7317V27.6315C1 26.7914 1.43418 26.0353 2.21569 25.6992Z" fill="black" stroke="black" stroke-width="0.5" stroke-miterlimit="10"/>
        </svg>
        Мы ценим каждого клиента и предлагаем индивидуальный подход к обслуживанию. Наша команда всегда
        готова помочь вам выбрать и оформить заказ, предоставить рекомендации и ответить на все ваши вопросы.
      </div>
      <div class="reasonInfo">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M6.90938 19.8906V23.5234C6.90938 23.7656 7.10313 23.9109 7.29688 23.9109H9.525C9.76719 23.9109 9.9125 23.7171 9.9125 23.5234V19.8906C9.9125 19.6484 10.1063 19.5031 10.3 19.5031H10.5906C10.9297 19.5031 11.1234 19.1156 10.9297 18.8734L8.75 16.0156C8.60469 15.8218 8.26563 15.8218 8.12032 16.0156L5.84375 18.8734C5.65 19.164 5.84375 19.5515 6.18282 19.5515H6.52188C6.76407 19.503 6.90938 19.6484 6.90938 19.8906Z" stroke="black" stroke-miterlimit="10"/>
          <path d="M14.7078 23.9109H17.4203C17.6141 23.9109 17.8078 23.7656 17.8078 23.5234V15.1922C17.8078 14.9984 17.9531 14.8047 18.1953 14.8047H18.7766C19.0672 14.8047 19.2609 14.4656 19.0672 14.2234L16.4031 10.8328C16.2578 10.6391 15.9672 10.6391 15.8219 10.8328L13.1094 14.175C12.9156 14.4172 13.0609 14.7563 13.4 14.7563H13.9812C14.175 14.7563 14.3203 14.9016 14.3203 15.1437L14.3687 23.5719C14.3203 23.7656 14.5141 23.9109 14.7078 23.9109Z" stroke="black" stroke-miterlimit="10"/>
          <path d="M22.4094 23.9109H24.4437C24.5891 23.9109 24.7344 23.7655 24.7344 23.6202V10.4452C24.7344 10.2999 24.8797 10.1546 25.025 10.1546H25.8484C26.0906 10.1546 26.2359 9.86399 26.0422 9.67024L23.6687 6.95774C23.5719 6.81243 23.3781 6.81243 23.2328 6.95774L20.8109 9.67024C20.6656 9.86399 20.7625 10.1546 21.0047 10.1546H21.8281C21.9734 10.1546 22.1187 10.2999 22.1187 10.4452V23.6202C22.1187 23.7655 22.2641 23.9109 22.4094 23.9109Z" stroke="black" stroke-miterlimit="10"/>
          <path d="M6.52187 4.63281C9.23437 2.35625 12.7219 1 16.5 1C25.0734 1 32 7.92656 32 16.5C32 25.0734 25.0734 32 16.5 32C7.92656 32 1 25.0734 1 16.5C1 13.4 1.92031 10.5422 3.47031 8.12031" stroke="black" stroke-miterlimit="10"/>
          <path d="M4.39062 6.61877L2.50156 7.49065C2.35625 7.53909 2.35625 7.78127 2.45312 7.87815L3.90625 8.8469C4.05156 8.94377 4.24531 8.8469 4.24531 8.70159L4.39062 6.61877Z" stroke="black" stroke-miterlimit="10"/>
          <path d="M6.08594 5.7468C6.56746 5.7468 6.95781 5.35645 6.95781 4.87493C6.95781 4.3934 6.56746 4.00305 6.08594 4.00305C5.60442 4.00305 5.21407 4.3934 5.21407 4.87493C5.21407 5.35645 5.60442 5.7468 6.08594 5.7468Z" stroke="black" stroke-miterlimit="10"/>
        </svg>
        Мы постоянно стремимся улучшить наши методы выращивания и сервис, чтобы удовлетворить все ваши ожидания.
        Ваше удовлетворение является нашей главной целью.
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'TheReason'
}
</script>

<style scoped>
.reasonWrapper{
  display: flex;
  flex-direction: column;
  width: 100%;
  height: 715px;
  box-sizing: border-box;
  padding: 30px 100px;
}
.reasonTitle{
  color: #04D100;
  font-family: Montserrat,sans-serif;
  font-size: 40px;
  margin-bottom: 30px;
}
.reasonInfoWrapper{
  margin-bottom: 30px;
  display: flex;
  flex-direction: column;
}
.reasonInfo{
  display: flex;
  flex-direction: row;
  width: 655px;
  height: 60px;
  text-align: left;
  margin-bottom: 45px;
  align-items: center;
}
.reasonInfo svg{
  margin-right: 25px;
  width: 82px;
  height: 52px;
  align-self: center;
}
.reasonInfo:nth-child(3) svg{
  width: 35px;
}
.reasonInfo:nth-child(5) svg{
  width: 65px;
}
</style>
